aaron-bond.better-comments
abusaidm.html-snippets
alefragnani.project-manager        
amandeepmittal.pug
Angular.ng-template
atomiks.moonlight
blanu.vscode-styled-jsx
bmewburn.vscode-intelephense-client
christian-kohler.npm-intellisense  
christian-kohler.path-intellisense 
CoenraadS.bracket-pair-colorizer-2 
dbaeumer.vscode-eslint
donjayamanne.githistory
dsznajder.es7-react-js-snippets    
eamodio.gitlens
eg2.vscode-npm-script
Equinusocio.vsc-material-theme     
esbenp.prettier-vscode
fabiospampinato.vscode-install-vsix
felixfbecker.php-intellisense      
formulahendry.auto-close-tag       
formulahendry.auto-rename-tag      
formulahendry.terminal
GitHub.vscode-pull-request-github  
hnw.vscode-auto-open-markdown-preview
HookyQR.beautify
ionutvmi.path-autocomplete
johnpapa.angular-essentials
johnpapa.Angular2
lacroixdavid1.vscode-format-context-menu
mgmcdermott.vscode-language-babel
mikestead.dotenv
mrmlnc.vscode-autoprefixer
mrmlnc.vscode-pugbeautify
mrmlnc.vscode-scss
msjsdiag.debugger-for-chrome
natewallace.angular2-inline
naumovs.color-highlight
octref.vetur
oderwat.indent-rainbow
PKief.material-icon-theme
pranaygp.vscode-css-peek
praveencrony.total-lines
ritwickdey.LiveServer
Shan.code-settings-sync
steoates.autoimport
syler.sass-indented
vscodevim.vim
xabikos.JavaScriptSnippets